---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisIncludeThermalProperties
source: html/08f60dc9-8875-d941-d5ae-df826a03ba6c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisIncludeThermalProperties Property

"Detailed Elements"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsEnergyAnalysisIncludeThermalProperties { get; }
```